# SetLevelElevationN

## Description
Sets the elevation of a Story Level relative to its Story.

```pascal
FUNCTION SetLevelElevationN(
				storyHandle  : HANDLE;
				levelType    : STRING;
				newElevation : REAL): BOOLEAN;
```

```python
def vs.SetLevelElevationN(storyHandle, levelType, newElevation):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|storyHandle|HANDLE|The handle of the Story with the desired Story Level.|
|levelType|STRING|The level type of the Story Level to change the elevation of.|
|newElevation|REAL|The new elevation for the Story Level. The elevation is in document units.|

## Examples
```pascal
resultOK := SetLevelElevationN(storyHandle, 'Example', 1.0);
```
```python
import vs

# Sets the elevation of a Story Level relative to its Story.
storyHandle = vs.FSActLayer()  # handle to the first selected object on the active layer
levelType = 'Example'
newElevation = 0.0

ok = vs.SetLevelElevationN(storyHandle, levelType, newElevation)
if ok:
    vs.Message('SetLevelElevationN succeeded')
else:
    vs.Message('SetLevelElevationN failed')
```

## See Also
VS Functions:
CreateStory
| AddStoryLevelN
| RemoveStoryLevel
| AddLevelFromTemplate
| GetLevelElevationN

## Version
Availability: from Vectorworks 2025

## Category
* Layers